README.md
```mermaid
sequenceDiagram

actor User
participant UA as User Agent
participant Client as Client
participant AS as Authorization Server
participant RS as Resource Server

rect rgba(255,0,0,.1)
note over UA,Client: Authentication Request
User ->> UA: Initiates login
UA ->> Client: Sends login request
Client ->> UA: Redirects to Authorization Server
UA ->> AS: Authorization Request (response_type=code)
AS ->> UA: Presents authentication & consent UI
UA ->> User: Shows authentication & consent
User ->> UA: Provides credentials & consent
UA ->> AS: Submits credentials & consent
AS ->> UA: Redirects back to Client with Authorization Code
UA ->> Client: Delivers Authorization Code
end

rect rgba(0,255,0,0.1)
note over Client,AS: Token Request
Client ->> AS: Token Request (code, client credentials)
AS ->> Client: Deferred Token Response (token pending)
end

rect rgba(0,0,255,0.1)
note over Client,AS: Token Retrieval
Client ->> AS: Polls for Token
AS ->> Client: Access Token (when ready)
end

rect rgba(255,0,255,.1)
note over Client,RS: Resource Access
Client ->> RS: Access Resource (with Access Token)
end
```
